import topSlider from "./main-category/topSlider"

export default [
    {
        id: 0,
        slug : "digital-devices",
        title: "کالای دیجیتال",
        iconTitle: "uil uil-desktop",
        content: [
            {
                subId: 1,
                subMenu: "لوازم جانبی موبایل",
                subItem: ["کیف و کاور گوشی", "پاور بانک (شارژر همراه)", "پایه نگهدارنده گوشی"]
            },
            {
                subId: 2,
                subMenu: "گوشی موبایل",
                subItem: ["اپل", "سامسونگ", "شیائومی", "هوآوی", "آنر", "نوکیا"]
            },
            {
                subId: 3,
                subMenu: "واقعیت مجازی"
            },
            {
                subId: 4,
                subMenu: "مچ بند و ساعت هوشمند"
            },
            {
                subId: 5,
                subMenu: "هدفون، ساعت و هندزفری"
            },
            {
                subId: 6,
                subMenu: "اسپیکر بلوتوث و با سیم"
            },
            {
                subId: 7,
                subMenu: "هارد، فلش و SSD"
            },
            {
                subId: 8,
                subMenu: "دوربین",
                subItem: ["دوربین عکاسی دیجیتال", "دوربین ورزشی و فیلم برداری", "دوربین چاپ سریع",]
            },

            {
                subId: 9,
                subMenu: "لوازم جانبی دوربین",
                subItem: ["لنز", "کیف", "کارت حافظه", "کاغذ چاپ عکس",]
            },
            {
                subId: 10,
                subMenu: "دوربین دو چشمی و شکاری"
            },
            {
                subId: 11,
                subMenu: "تلسکوپ"
            },
            {
                subId: 12,
                subMenu: "پلی استیشن، ایکس باکس و بازی"
            },
            {
                subId: 13,
                subMenu: "پلی استیشن، ایکس باکس و بازی",
                subItem: ["تجهیزات مخصوص بازی", "مانیتور", "کیس‌های اسمبل شده", "قطعات داخلی کامپیوتر", "ماوس", "کیبورد",]
            },
            {
                subId: 14,
                subMenu: "لپ تاپ",

            },
            {
                subId: 15,
                subMenu: "لوازم جانبی لپ تاپ",
                subItem: ["کیف، کوله و کاور", "کابل‌ صدا، AUX و HDMI"]
            },
            {
                subId: 16,
                subMenu: "تبلت"
            },
            {
                subId: 17,
                subMenu: "شارژر تبلت و موبایل"
            },
            {
                subId: 18,
                subMenu: "کیف، کاور، لوازم جانبی تبلت"
            },
            {
                subId: 19,
                subMenu: "باتری"
            },
            {
                subId: 20,
                subMenu: "دوربین‌های تحت شبکه"
            },
            {
                subId: 21,
                subMenu: "مودم و تجهیزات شبکه"
            },
            {
                subId: 22,
                subMenu: "ماشین های اداری",
                subItem: ["تلفن، بی سیم و سانترال", "فکس", "پرینتر", "لوازم جانبی اداری",]
            },
            {
                subId: 23,
                subMenu: "کتابخوان فیدیبوک"
            },
            {
                subId: 24,
                subMenu: "کارت هدیه خرید از دیجی‌کالا"
            },
        ],
        body : [
            {
                slider : topSlider[0],
            }
        ]
    },
    {
        id: 1,
        slug : "vehicles",
        title: "خودرو، ابزار و تجهیزات صنعتی",
        iconTitle: "uil uil-wrench",
        content: [
            {
                subId: 1,
                subMenu: "موتور سیکلت",

            },
            {
                subId: 2,
                subMenu: "لوازم جانبی خودرو و موتور سیکلت",
                subItem: ["لوازم تزئینی", "سیستم صوتی و تصویری", "نظافت و نگهداری خودرو", "کلاه کاسکت و لوازم جانبی موتور"]
            },
            {
                subId: 3,
                subMenu: "لوازم یدکی خودرو و موتور سیکلت",
                subItem: ["دیسک و صفحه کلاچ", "جلوبندی و تعلیق", "چراغ خودرو", "تسمه خودرو", "کمک فنر"]
            },
            {
                subId: 4,
                subMenu: "لوازم مصرفی خودرو و...",
                subItem: ["لاستیک و تایر", "لنت ترمز", "روغن موتور و ضد یخ", "مکمل سوخت و روغن و انواع فیلتر"]
            },
            {
                subId: 5,
                subMenu: "ابزار برقی",
                subItem: ["دریل، پیچ گوشتی برقی و شارژی", "فرز و سنگ رومیزی", "موتور برقی", "مکنده و دمنده", "کارواش", "کمپرسور و جک خودرو", "ابزار همه کاره برقی و شارژی",]
            },
            {
                subId: 6,
                subMenu: "ابزار غیر برقی",
                subItem: ["ابزار دستی", "مجموعه ابزار", "نردبان", "پیچ گوشتی و فازمتر", "نظم دهنده ابزار", "متر، تراز، اندازه گیری دقیق", "لوازم روانکاری", "چسب صنعتی"]
            },
            {
                subId: 7,
                subMenu: "لوازم و یراق آلات ساختمانی",
                subItem: ["شیرآلات", "رنگ", "دستگیره در"]
            },
            {
                subId: 8,
                subMenu: "لوازم باغبانی",
                subItem: ["قیجی ، چاقو و ابزار باغبانی", "بذر و تخم گیاهان", "تبر، بیل و کلنگ", "خاک، کود و آفت کش"]
            },

            {
                subId: 9,
                subMenu: "نور و روشنایی",
                subItem: ["لوستر و آباژور", "لامپ", "چندراهی برق و محافظ ولتاژ"]
            },
            {
                subId: 10,
                subMenu: "تجهیزات ایمنی و کار",
                subItem: ["کلاه ایمنی"]
            },
            {
                subId: 11,
                subMenu: "حفاظتی و ایمنی",
                subItem: ["گاوصندوق"]
            },
        ],
        body : [
            {
                slider : topSlider[1],
            }
        ]
    },
    {
        id: 2,
        slug : "apparel",
        title: "مد و پوشاک",
        iconTitle: "uil uil-wrench",
        content: [
            {
                subId: 1,
                subMenu: "مردانه",
            },
            {
                subId: 2,
                subMenu: "لباس مردانه",
                subItem: ["تیشرت", "پیراهن", "شلوار", "لباس زیر"]
            },
            {
                subId: 3,
                subMenu: "کفش مردانه",
                subItem: ["کفش روزمره", "کفش رسمی"]
            },
            {
                subId: 4,
                subMenu: "اکسسوری مردانه",
                subItem: ["ساعت", "کیف", "کمربند"]
            },
            {
                subId: 5,
                subMenu: "زنانه"
            },
            {
                subId: 6,
                subMenu: "لباس زنانه",
                subItem: ["پوشش اسلامی و مانتو", "بلوز و شومیز", "تیشرت", "شلوار و سرهمی", "لباس زیر",]
            },
            {
                subId: 7,
                subMenu: "کفش زنانه",
                subItem: ["کفش روزمره", "کفش تخت"]
            },
            {
                subId: 8,
                subMenu: "اکسسوری زنانه",
                subItem: ["ساعت", "کیف", "شال و روسری"]
            },

            {
                subId: 9,
                subMenu: "زیورآلات زنانه",
                subItem: ["دستبند", "گوشواره", "گردنبند"]
            },
            {
                subId: 10,
                subMenu: "زیورآلات طلا زنانه",
                subItem: ["دستبند", "گوشواره", "آویز", "گردنبند"]
            },
            {
                subId: 11,
                subMenu: "زیورآلات طلا بچگانه"
            },
            {
                subId: 12,
                subMenu: "زیورآلات نقره زنانه"
            },
            {
                subId: 13,
                subMenu: "عینک آفتابی زنانه"
            },
            {
                subId: 14,
                subMenu: "عینک آفتابی مردانه"
            },
            {
                subId: 15,
                subMenu: "پوشاک ورزشی مردانه"
            },
            {
                subId: 16,
                subMenu: "پوشاک ورزشی زنانه"
            },
            {
                subId: 17,
                subMenu: "کفش ورزشی مردانه"
            },
            {
                subId: 18,
                subMenu: "کفش ورزشی زنانه"
            },
            {
                subId: 19,
                subMenu: "پوشاک ورزشی پسرانه"
            },
            {
                subId: 20,
                subMenu: "پوشاک ورزشی دخترانه"
            },
            {
                subId: 21,
                subMenu: "کفش ورزشی پسرانه"
            },
            {
                subId: 22,
                subMenu: "کفش ورزشی دخترانه"
            },
            {
                subId: 23,
                subMenu: "کوله پشتی مردانه"
            },
            {
                subId: 24,
                subMenu: "بچه گانه"
            },
        ],
        body : [
            {
                slider : topSlider[2],
            }
        ]
    },
    // {
    //     id: 3,
    //     slug : "",
    //     title: "کالا های سوپر مارکتی",
    //     iconTitle: "uil uil-shopping-basket",
    //     content: [
    //         {
    //             subId: 1,
    //             subMenu: "کالای اساسی و خوار وبار",
    //             subItem: ["نان", "برنج", "روغن", "قند", "شکر", "سس", "رب و کنسرو گوجه", "خیارشور و ترشیجات", "آبلیمو، آبغوره و سرکه", "ماکارانی، پاستا و رشته", "زعفران، زرشک و تزیینات غذا", "حبوبات و سویا"]

    //         },
    //         {
    //             subId: 2,
    //             subMenu: "صبحانه",
    //             subItem: ["مربا", "عسل", "حلواشکری، ارده و کنجد"]
    //         },
    //         {
    //             subId: 3,
    //             subMenu: "مواد پروتئینی",
    //             subItem: ["سوسیس و کالباس", "گوشت گوسفندی", "گوشت مرغ", "تخم مرغ", "گوشت گاو و گوساله", "میگو", "تن ماهی"]
    //         },
    //         {
    //             subId: 4,
    //             subMenu: "لبنیات",
    //             subItem: ["شیر", "ماست", "پنیر", "خامه"]
    //         },
    //         {
    //             subId: 5,
    //             subMenu: "نوشیدنی ها",
    //             subItem: ["چای", "دمنوش", "قهوه", "آب و آب معدنی", "ماءالشعیر", "نوشابه", "شربت و آبمیوه"]
    //         },
    //         {
    //             subId: 6,
    //             subMenu: "میوه و سبزی",

    //         },
    //         {
    //             subId: 7,
    //             subMenu: "غذای آماده و نودل",
    //         },
    //         {
    //             subId: 8,
    //             subMenu: "فرآورده‌های منجمد",
    //         },

    //         {
    //             subId: 9,
    //             subMenu: "کنسرو و کمپوت",
    //         },
    //         {
    //             subId: 10,
    //             subMenu: "تنقلات",
    //             subItem: ["شکلات، تافی و آبنبات", "بیسکویت و ویفر", "مغز طعم‌دار خشکبار", "کیک و کلوچه", "چیپس و پاپ کورن", "پفک و اسنک", "آدامس و خوشبوکننده"]
    //         },
    //         {
    //             subId: 11,
    //             subMenu: "خشکبار و شیرینی",

    //         },
    //     ],
    //     body : [
    //         {
                
    //         },
    //     ]
    // },
    {
        id: 4,
        slug : "mother-and-child",
        title: "اسباب بازی، کودک و نوزاد",
        iconTitle: "uil uil-kid",
        content: [
            {
                subId: 1,
                subMenu: "بهداشت و حمام کودک و نوزاد",
                subItem: [ "پزشک", "دستمال مرطوب", "حوله", "وان حمام نوزاد", "مینی واش", "شامپو کودک و نوزاد"]
            },
            {
                subId: 2,
                subMenu: "پوشاک و کفش کودک و نوزاد",
                subItem: ["لباس کودک و لباس نوزادی", "کفش", "کفش ورزشی", "جوراب و پاپوش کودک و نوزاد", "کلاه و پیشبند نوزاد"]
            },
            {
                subId: 3,
                subMenu: "تبلت"
            },
            {
                subId: 4,
                subMenu: "بازی و سرگرمی کودک",
                subItem: ["ماشین بازی، موتور، سه چرخه", "دوچرخه", "تشک بازی و پارک بازی", "تاب و سرسره"]
            },
            {
                subId: 5,
                subMenu: "سلامت، ایمنی و مراقبت",
                subItem: ["تصفیه هوا", "ترازو", "دوربین و پیجر اتاق کودک", "تب سنج و دماسنج", "محافظ و ابزار ایمنی"]
            },
            {
                subId: 6,
                subMenu: "خواب کودک",
                subItem: ["مبلمان اتاق کودک", "چراغ خواب کودک", "تشک کودک", "سرویس خواب", "پتو", "بالش شیردهی"]
            },
            {
                subId: 7,
                subMenu: "ملزومات گردش و سفر",
                subItem: ["کالسکه و کریر", "صندلی خودرو کودک و نوزاد", "ساک لوازم نوزاد", "لوازم جانبی گردش و سفر", "آغوشی"]
            },
            {
                subId: 8,
                subMenu: "لوازم شخصی",
                subItem: ["پستانک و ملزومات", "شیردوش", "شورت آموزشی"]
            },

            {
                subId: 9,
                subMenu: "غذاخوری",
                subItem: ["صندلی غذاخوری", "شیشه شیر، سرلاک، داروخوری"]
            },

        ],
        body : [
            {
                slider : topSlider[3],
            }
        ]
    },
    {
        id: 5,
        slug : "personal-appliance",
        title: "زیبایی و سلامت",
        iconTitle: "uil uil-heartbeat",
        content: [
            {
                subId: 1,
                subMenu: "لوازم آرایشی",
                subItem: ["آرایش چشم و ابرو", "آرایش لب", "آرایش صورت", "مواد آرایش مو", "سنگ پا، بهداشت و زیبایی ناخن", "تجهیزات جانبی آرایشی"]

            },
            {
                subId: 2,
                subMenu: "لوازم بهداشتی",
                subItem: ["کرم و مراقبت پوست", "شامپو و مراقبت مو", "بهداشت دهان و دندان", "بهداشت و مراقبت بدن", "ضد تعریق"]
            },
            {
                subId: 3,
                subMenu: "لوازم شخصی برقی",
                subItem: ["ماشین اصلاح صورت", "ماشین اصلاح سر", "سشوار", "اصلاح بدن آقایان", "اصلاح بدن بانوان", "اصلاح موی گوش، بینی و ابرو", "برس پاک سازی", "اتو مو و حالت دهنده", "بیگودی و فر کننده", "مسواک برقی", "لیزر"]
            },
            {
                subId: 4,
                subMenu: "عطر، ادکلن، اسپری و ست",
                subItem: ["مردانه", "زنانه", "جیبی", "اسپری"]
            },
            {
                subId: 5,
                subMenu: "طلا، نقره و زیورآلات زنانه",
                subItem: ["زیورآلات نقره زنانه", "زیورآلات طلا زنانه", "حلقه و انگشتر طلای زنانه", "دستبند طلا زنانه", "گردنبند طلا زنانه", "گوشواره طلا زنانه"]
            },
            {
                subId: 6,
                subMenu: "زیورآلات نقره مردانه",
            },
            {
                subId: 7,
                subMenu: "ابزار سلامت و طبی",
                subItem: ["مچ بند و ساعت هوشمند", "ترازو", "کالای خواب و استراحت طبی", "تست قند خون", "تب سنج", "فشارسنج", "ابزار مراقبت پا", "نمایشگر ضربان قلب", "ماساژور", "تشک و پتوی برقی", "ویلچر"]
            },
        ],
        body : [
            {
                slider : topSlider[4],
            }
        ]
    },
    {
        id: 6,
        slug : "home-and-kitchen",
        title: "خانه و آشپزخانه",
        iconTitle: "uil uil-lamp",
        content: [
            {
                subId: 1,
                subMenu: "صوتی و تصویری",
                subItem: ["تلویزیون", "سینمای خانگی و ساندبار", "گیرنده دیجیتال تلویزیون"]
            },
            {
                subId: 2,
                subMenu: "دکوراتیو",
                subItem: ["مبلمان خانگی", "دکوراسیون اداری", "آینه", "پرده", "تابلو", "ساعت دیواری و رومیزی", "شمع، گل و گلدان"]
            },
            {
                subId: 3,
                subMenu: "فرش ماشینی، دستبافت، تابلو"
            },
            {
                subId: 4,
                subMenu: "لوازم برقی خانگی",
                subItem : ["یخچال و فریزر", "ماشین لباسشویی", "ماشین ظرفشویی", "هود", "گاز صفحه ای", "اجاق گاز", "مایکروویو، مایکروفر", "جاروبرقی", "جارو شارژی", "تلفن، بی سیم و سانترال", "کولر، پنکه، تصفیه هوا", "قهوه و چای ساز، آب میوه گیر", "اتو بخار و پرسی"]
            },
            {
                subId: 5,
                subMenu: "حیوانات خانگی، غذا و لوازم",
                subItem : ["آکواریوم، غذا و لوازم آبزیان"]
            },
            {
                subId: 6,
                subMenu: "سرو و پذیرایی",
                subItem : ["سرویس غذاخوری", "قاشق، چنگال و کارد", "پارچ، بطری، لیوان و ماگ", "ظروف پذیرایی"]
            },
            {
                subId: 7,
                subMenu: "نور و روشنایی",
                subItem : ["لامپ، چراغ و ریسه", "لوستر و چراغ تزیینی"]
            },
            {
                subId: 8,
                subMenu: "آشپزخانه",
                subItem: ["سرویس و ظروف پخت و پز", "فلاسک و کلمن", "کتری، قوری، لوازم سرو چای", "ظروف یکبار مصرف"]
            },

            {
                subId: 9,
                subMenu: "مواد شوینده",
                subItem: ["شوینده ظروف", "شوینده لباس", "تمیزکننده سطوح"]
            },
            {
                subId: 10,
                subMenu: "دستمال کاغذی",
            },
            {
                subId: 11,
                subMenu: "ملحفه، سرویس، لوازم خواب",
            },
            {
                subId: 12,
                subMenu: "حوله و وسایل حمام",
            },
            {
                subId: 13,
                subMenu: "پادری، کمد، لوازم اتاق خواب",
            },
            {
                subId: 14,
                subMenu: "لوازم دستشویی و روشویی",

            },

        ],
        body : [
            {
                slider : topSlider[5],
            }
        ]
    },
]
